tutorials/multiphase/compressibleInterDyMFoam/laminar/sphereDrop/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

    innerAMI
    {
        type            cyclicAMI;
        value           uniform 101325;
    }

    outerAMI
    {
        type            cyclicAMI;
        value           uniform 101325;
    }

    top
    {
        type            fixedValue;
        value           uniform 101325;
    }

    bottom
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 101325;
    }

    farFieldWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 101325;
    }

    sphere
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 101325;
    }
}


// ************************************************************************* //
